Revit 2024 API
ElementTypeDuplicatedEventArgs.NewName Property
 The name of the newly duplicated ElementType.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public string NewName { get; }
Visual Basic
Public ReadOnly Property NewName As String
	Get
Visual C++
public:
property String^ NewName {
	String^ get ();
}
See Also
ElementTypeDuplicatedEventArgs Class
Autodesk.Revit.DB.Events Namespace